Австралия/src/Catalogs/DiscountConditions/DiscountConditions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>DiscountConditions</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AssignmentCondition</name>
    <type>
      <types>EnumRef.DiscountCondition</types>
    </type>
  </attributes>
  <attributes>
    <name>UseRestrictionCriterionForSalesVolume</name>
    <type>
      <types>EnumRef.DiscountSalesAmountLimit</types>
    </type>
  </attributes>
  <attributes>
    <name>RestrictionArea</name>
    <type>
      <types>EnumRef.DiscountApplyingArea</types>
    </type>
  </attributes>
  <attributes>
    <name>RestrictionConditionValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RestrictionCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ComparisonType</name>
    <type>
      <types>EnumRef.DiscountValuesComparisonTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>TakeIntoAccountSaleOfOnlyParticularProductsList</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>PurchaseKit</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SalesFilterByProducts</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Австралия/src/Enums/DiscountCondition/DiscountCondition.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DiscountCondition</name>
  <enumValues>
    <name>ForOneTimeSalesVolume</name>
  </enumValues>
  <enumValues>
    <name>ForKitPurchase</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/DiscountSalesAmountLimit/DiscountSalesAmountLimit.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>DiscountSalesAmountLimit</name>
  <enumValues>
    <name>Amount</name>
  </enumValues>
  <enumValues>
    <name>Quantity</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Catalogs/DiscountConditions/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

// Procedure - FillCheckProcessing event handler.
//
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	
	UsedCurrencies = GetFunctionalOption("ForeignExchangeAccounting");
	
	If AssignmentCondition = Enums.DiscountCondition.ForOneTimeSalesVolume Then
		
		CheckedAttributes.Clear();
		CheckedAttributes.Add("RestrictionArea");
		CheckedAttributes.Add("UseRestrictionCriterionForSalesVolume");
		CheckedAttributes.Add("ComparisonType");
		If  UseRestrictionCriterionForSalesVolume = Enums.DiscountSalesAmountLimit.Amount 
			AND UsedCurrencies 
		Then
			CheckedAttributes.Add("RestrictionCurrency");
		EndIf;
		
	ElsIf AssignmentCondition = Enums.DiscountCondition.ForKitPurchase Then
		
		CheckedAttributes.Clear();
		CheckedAttributes.Add("PurchaseKit");
		CheckedAttributes.Add("PurchaseKit.Products");
		CheckedAttributes.Add("PurchaseKit.PackingsQuantity");
		CheckedAttributes.Add("PurchaseKit.Quantity");
		
	EndIf;
	
	CheckedAttributes.Add("Description");
	CheckedAttributes.Add("AssignmentCondition");
	
EndProcedure

// Procedure - BeforeWrite event handler.
//
Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
	If Not IsFolder Then
		TakeIntoAccountSaleOfOnlyParticularProductsList = AssignmentCondition = Enums.DiscountCondition.ForOneTimeSalesVolume AND 
																(SalesFilterByProducts.Count() > 0);
															EndIf;
	
	If AssignmentCondition = Enums.DiscountCondition.ForKitPurchase Then
		SalesFilterByProducts.Clear();
	ElsIf AssignmentCondition = Enums.DiscountCondition.ForOneTimeSalesVolume Then
		PurchaseKit.Clear();
	EndIf;
	
EndProcedure

// Procedure - FillingProcessor event handler.
//
Procedure Filling(FillingData, FillingText, StandardProcessing)
	
	If Not IsFolder Then
		RestrictionCurrency = DriveReUse.GetFunctionalCurrency();
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
